# _*_ coding: utf-8 _*_

import json

obj = {"":"2017-02-21 13:50","aaData":[["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核一#1","636.0","0.0","0.0%","歲修逾排程"],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核一#2","636.0","628.4","98.8%"," "],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核二#1","985.0","0.0","0.0%","歲修逾排程"],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核二#2","985.0","0.0","0.0%","歲修逾排程"],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核三#1","951.0","943.8","99.2%"," "],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","核三#2","951.0","941.5","99.0%"," "],["<A NAME=\"nuclear\"></A><b>核能(Nuclear)</b>","小計","5144.0(11.9%)","2513.7(9.4%)","",""],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","林口#1","800.0","762.2","95.3%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","林口#2(註10)","-","762.7","95.3%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#1","550.0","531.9","96.7%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#2","550.0","531.1","96.6%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#3","550.0","528.2","96.0%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#4","550.0","535.3","97.3%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#5","550.0","537.6","97.7%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#6","550.0","0.0","0.0%","歲修"],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#7","550.0","527.6","95.9%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#8","550.0","532.7","96.9%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#9","550.0","522.9","95.1%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","台中#10","550.0","528.4","96.1%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","興達#1","500.0","465.7","93.1%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","興達#2","500.0","446.1","89.2%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","興達#3","550.0","499.8","90.9%"," "],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","興達#4","550.0","0.0","0.0%","歲修"],["<A NAME=\"coal\"></A><b>燃煤(Coal)</b>","小計","8400.0(19.5%)","7712.2(28.9%)","",""],["<A NAME=\"cogen\"></A><b>汽電共生(Co-Gen)</b>","汽電共生","622.1","1265.5","-"," "],["<A NAME=\"cogen\"></A><b>汽電共生(Co-Gen)</b>","小計","622.1(1.4%)","1265.5(4.7%)","",""],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","和平#1","648.6","603.8","93.1%"," "],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","和平#2","648.6","600.2","92.5%"," "],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","麥寮#1","600.0","572.8","95.5%"," "],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","麥寮#2","600.0","569.0","94.8%"," "],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","麥寮#3","600.0","573.2","95.5%"," "],["<A NAME=\"ippcoal\"></A><b>民營電廠-燃煤(IPP-Coal)</b>","小計","3097.1(7.2%)","2919.0(10.9%)","",""],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#1","742.7","0.0","0.0%","檢修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#2","742.7","0.0","0.0%","歲修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#3","724.7","644.0","88.9%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#4","724.7","304.7","42.0%","部分故障"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#5","724.7","676.8","93.4%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大潭CC#6","724.7","392.5","54.2%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#1","258.5","147.9","57.2%","電源線限制"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#2","258.5","228.3","88.3%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#3","246.8","0.0","0.0%","檢修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#4","386.0","330.6","85.6%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#5","386.0","350.3","90.8%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","通霄CC#6","321.2","140.0","43.6%","部分歲修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","興達CC#1","445.2","0.0","0.0%","故障"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","興達CC#2","445.2","112.5","25.3%","EOH限制"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","興達CC#3","445.2","329.1","73.9%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","興達CC#4","445.2","78.8","17.7%","檢修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","興達CC#5","445.2","213.4","47.9%","部分檢修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","南部CC#1","288.8","223.0","77.2%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","南部CC#2","288.8","0.0","0.0%","歲修"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","南部CC#3","288.8","162.8","56.4%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","南部CC#4","251.4","185.2","73.7%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大林#5","500.0","404.8","81.0%","環保限制"],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","大林#6","550.0","537.6","97.7%"," "],["<A NAME=\"lng\"></A><b>燃氣(LNG)</b>","小計","10634.9(24.7%)","5462.3(20.5%)","",""],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","海湖#1","450.0","395.3","87.8%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","海湖#2","450.0","462.3","102.7%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","新桃#1","600.0","602.8","100.5%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","國光#1","480.0","390.8","81.4%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","星彰#1","490.0","530.3","108.2%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","星元#1","490.0","269.3","55.0%","部分故障"],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","嘉惠#1","670.0","662.9","98.9%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","豐德#1","490.0","455.7","93.0%"," "],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","豐德#2","490.0","0.0","0.0%","合約限制"],["<A NAME=\"ipplng\"></A><b>民營電廠-燃氣(IPP-LNG)</b>","小計","4610.0(10.7%)","3769.4(14.1%)","",""],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","協和#1","500.0","368.8","73.8%","運轉限制"],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","協和#2","500.0","0.0","0.0%","歲修"],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","協和#3","500.0","483.5","96.7%"," "],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","協和#4","500.0","462.0","92.4%","運轉限制"],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","大林#3","375.0","0.0","0.0%","環保限制"],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","大林#4","375.0","0.0","0.0%","環保限制"],["<A NAME=\"oil\"></A><b>燃油(Oil)</b>","小計","2750.0(6.4%)","1314.3(4.9%)","",""],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核一Gas1","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核一Gas2","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核二Gas1","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核二Gas2","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核三Gas1","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","核三Gas2","-","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","台中Gas1&amp;2","140.0","0.0","0.0%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","台中Gas3&amp;4","140.0","0.0","0.0%","部分檢修"],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","澎湖尖山(註4)","129.8","29.1","22.4%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","金門塔山(註4)","91.0","26.8","29.5%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","馬祖珠山(註4)","29.7","5.8","19.5%"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","離島其他(註4)","42.7","N/A","N/A"," "],["<A NAME=\"diesel\"></A><b>輕油(Diesel)</b>","小計(註5)","573.2(1.3%)","61.7(0.2%)","",""],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","德基#1","78.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","德基#2","78.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","德基#3","78.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","青山#1","92.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","青山#2","92.0","17.1","18.6%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","青山#3","92.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","青山#4","92.0","24.3","26.4%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","谷關#1","54.4","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","谷關#2","54.4","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","谷關#3","54.4","44.0","80.8%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","谷關#4","54.4","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","天輪#1","22.5","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","天輪#2","22.5","12.4","55.1%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","天輪#3","22.5","13.0","57.8%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","天輪#4","22.5","12.6","56.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","天輪#5","105.0","0.0","0.0%","歲修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","馬鞍#1","66.7","19.6","29.4%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","馬鞍#2","66.7","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","卓蘭#1","40.0","0.0","0.0%","歲修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","卓蘭#2","40.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","萬大#1","10.4","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","萬大#2","10.4","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","萬大#3","15.3","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","萬大#4","19.7","20.2","102.5%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","松林#1&amp;2","20.9","5.7","27.3%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","大觀一#1","22.0","19.8","90.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","大觀一#2","22.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","大觀一#3","22.0","19.9","90.5%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","大觀一#4","22.0","19.7","89.5%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","大觀一#5","22.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","鉅工#1","21.8","12.3","56.6%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","鉅工#2","21.8","12.2","56.1%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","水里#1","12.8","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","立霧#1&amp;#2","32.0","0.0","0.0%","歲修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","龍澗#1","48.6","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","龍澗#2","48.6","0.0","0.0%","歲修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","碧海","61.2","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","烏來&amp;桂山&amp;粗坑","40.5","8.4","20.7%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","北部小水力(註6)","26.6","9.0","33.8%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","中部小水力(註6)","9.8","2.0","20.4%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","南部小水力(註6)","7.2","1.0","13.9%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","東部小水力(註6)","54.6","24.0","44.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","翡翠#1","70.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","石門#1","45.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","石門#2","45.0","0.0","0.0%","檢修"],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","曾文#1","50.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","義興#1","40.0","0.0","0.0%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","名間","16.7","3.9","23.4%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","嘉南西口&amp;嘉南烏山頭","20.3","8.8","43.4%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","后里示範","0.1","N/A","N/A"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","卑南","935.6","1.4","0.1%"," "],["<A NAME=\"hydro\"></A><b>水力(Hydro)</b>","小計","3022.9(7.0%)","311.3(1.2%)","",""],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","石門","4.0","0.7","17.2%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","林口","6.0","4.2","70.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","蘆竹","7.2","5.6","77.8%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","大潭","15.1","12.8","84.8%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","觀園","30.0","27.3","91.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","香山","12.0","0.0","0.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","中火","6.0","2.0","32.8%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","中港","36.0","21.9","60.8%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","王功","23.0","23.6","102.7%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","彰工","62.0","3.4","5.4%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","雲麥","46.0","41.5","90.1%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","四湖","28.0","27.4","97.9%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","恆春","4.5","4.6","102.2%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","澎湖中屯","4.8","4.0","83.3%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","金門金沙","4.0","0.0","0.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","澎湖湖西","5.4","4.5","83.2%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","苗栗竹南","7.8","4.8","61.5%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","苗栗大鵬","42.0","N/A","N/A"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","鹿威彰濱","55.2","49.6","89.9%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","鹿威鹿港","41.4","33.9","81.9%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","觀威觀音&amp;桃威觀屋","48.3","35.5","73.5%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","中威大安","82.8","2.0","2.4%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","崎威崎頂","6.9","2.2","31.9%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","豐威新豐","11.5","11.0","95.7%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","龍威後龍","44.1","33.8","76.6%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","苗栗通苑","27.6","25.3","91.7%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","安威","2.3","0.0","0.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","清風","2.3","N/A","N/A"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","東鋼","11.5","8.4","73.0%"," "],["<A NAME=\"wind\"></A><b>風力(Wind)</b>","小計","677.7(1.6%)","412.9(1.5%)","",""],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","金門","0.5","0.117","22.1%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","中火","2.1","0.648","30.5%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","興達","1.6","0.427","26.2%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","民雄","0.1","0.014","23.3%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","中部儲運","0.1","0.052","57.8%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","新伯公","0.1","0.063","52.5%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","永安鹽灘","4.6","1.074","23.1%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","路北","0.1","0.013","21.7%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","中大","0.0","0.028","70.0%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","大潭","0.6","0.444","68.3%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","核三廠","1.5","0.539","36.9%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","七美","0.2","0.039","26.0%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","尖山","0.1","0.012","17.1%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","卓蘭","0.0","0.025","62.5%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","后里","0.1","0.065","72.2%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","台中龍井","6.5","3.327","51.3%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","太陽能購電(註7)","898.1","404.872","45.1%"," "],["<A NAME=\"solar\"></A><b>太陽能(Solar)</b>","小計","916.3(2.1%)","411.8(1.5%)","",""],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","大觀二#1","250.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","大觀二#2","250.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","大觀二#3","250.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","大觀二#4","250.0","145.2","58.1%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#1","267.0","183.0","68.5%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#2","267.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#3","267.0","182.0","68.2%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#4","267.0","0.0","0.0%","檢修"],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#5","267.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","明潭#6","267.0","0.0","0.0%"," "],["<A NAME=\"pumpinggen\"></A><b>抽蓄發電(Pumping Gen)</b>","小計","2602.0(6.0%)","510.2(1.9%)","",""],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","大觀二#1","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","大觀二#2","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","大觀二#3","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","大觀二#4","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#1","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#2","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#3","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#4","-","0.0","-","檢修"],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#5","-","0.0","-"," "],["<A NAME=\"pumpingload\"></A><b>抽蓄負載(Pumping Load)</b>","明潭#6","-","0.0","-"," "]]}

encodedjson = obj  # json.dumps(obj)
# decodejson = json.loads(encodedjson)
print()


""" # ----------------------------------------
核能
    核一 新北市石門區 2
    核二 新北市萬里區 2
    核三 屏東縣恆春鎮 2
燃煤
    林口 新北市林口區 2
    台中 臺中市龍井區 10
    興達 高雄市永安區 4
汽電共生
    ?
民營燃煤
    和平 花蓮縣秀林鄉 2
    麥寮 雲林縣麥寮鄉 3
燃氣
    大潭 桃園市觀音區 6
    通霄 苗栗縣通霄鎮 6
    興達 高雄市永安區 5
    南部 高雄市前鎮區 4
    大林 高雄市小港區 2
民營燃氣
    海湖 桃園市蘆竹區 2
    新桃 新竹縣關西鎮 1
    國光 桃園市龜山區 1
    星彰 1
    星元 彰化縣鹿港鎮 1
    嘉惠 嘉義縣民雄鄉 1
    豐德 臺南市山上區2
燃油
    協和 基隆市中山區 4
    大林 高雄市小港區 2
輕油
    核一 新北市石門區 2
    核二 新北市萬里區 2
    核三 屏東縣恆春鎮 2
    台中 臺中市龍井區 2
    澎湖尖山 澎湖縣湖西鄉 1
    金門塔山 福建省金門縣金城鎮 1
    馬祖珠山 1
    離島其他 1
水力
    德基 3
    青山 4
    谷關 4
    天輪 5
    馬鞍 2
    卓蘭 2
    萬大 4
    松林 1
    大觀一 5
    鉅工 2
    水里 1
    立霧 1
    龍澗 2
    碧海 1
    烏來&桂山&粗坑1
    北部 1
    中部 1
    南部 1
    東部 1
    翡翠 1
    石門 2
    曾文 1
    嘉興 1
    名間 1
    嘉南西口&嘉南烏山頭 1
    后里示範 1
    卑南 1
風力
    石門 1
    林口 1
    蘆竹 1
    大潭 1
    觀園 1
    香山 1
    中火 1
    中港 1
    王功 1
    彰工 1
    雲麥 1
    四湖 1
    恆春 1
    澎湖中屯 1
    金門金沙 1
    澎湖湖西 1
    苗栗竹南 1
    苗栗大鵬 1
    鹿威彰濱 1
    鹿威鹿港 1
    關威觀音&桃威觀屋 1
    中威大安 1
    崎威崎頂 1
    豐威新豐 1
    龍威後龍 1
    苗栗通苑 1
    安威 1
    清風 1
    東鋼 1
太陽能
    金門 1
    中火 1
    興達 1
    民雄 1
    中部儲運 1
    新伯公 1
    永安鹽攤 1
    路北 1
    中大 1
    大潭 1
    核三 1
    七美 1
    尖山 1
    卓蘭 1
    后里 1
    台中龍井 1
    太陽能購電 1
抽搐發電
    大觀二  4
    明潭 6
抽搐負載
    大觀二 4
    明潭 6
# -----------------------------------------"""